Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: When we do so, we can still call the parent class's method with the C<SUPER> pseudo-class.
es: En ese caso, aún es posible llamar al método de la clase primaria mediante la seudoclase C<SUPER>.

source: When we instantiate an object, we assign values to those attributes.
es: Cuando se crea una instancia de un objeto, se asignan valores a sus atributos.

source: When we make a method call, Perl arranges for the method's B<invocant> to be passed as the first argument.
es: Cuando se hace la llamada a un método, Perl pasa el B<autor de la llamada> como primer argumento.

source: When we want to create a specific object, we start with its class, and B<construct> or B<instantiate> an object.
es: Para construir un objeto específico, se comienza con la clase asociada y se B<construye> (o se B<crea una instancia de>) un objeto.

source: When you call a method, the thing on the left side of the arrow is passed as the first argument to the method.
es: Cuando se llama a un método, lo que hay a la izquierda de la flecha se pasa como primer argumento al método.

source: When you change a L</value> as it is being copied.
es: Se dice de la acción de modificar un L</valor> mientras se copia.

source: When you have finished your work, please perform a final rebase and test.
es: Cuando haya terminado su trabajo, haga una última reorganización y ejecute las pruebas.

source: When you use the B<-n> and B<-p> switches to Perl, C<BEGIN> and C<END> work just as they do in B<awk>, as a degenerate case.
es: Cuando se usan los modificadores B<-n> y B<-p> en Perl, C<BEGIN> y C<END> funcionan como lo harían en B<awk>, es decir, como un caso degenerado.

source: When you use the C<use warnings> pragma or Perl's B<-w> command-line option, you may see warnings about useless uses of constants or functions in "void context".
es: Si se utiliza el pragma C<use warnings> o la opción de línea de comandos B<-w>, pueden aparecer advertencias sobre el uso inútil de constantes o funciones en contexto vacío ("I<void>").

source: When you're done with your filehandles, you should C<close()> them (though to be honest, Perl will clean up after you if you forget):
es: Cuando termine de trabajar con los identificadores de archivo, debe cerrarlos con C<close()> (de todos modos, Perl se encargará de ello si se le olvida):

source: When you're talking about an L</array>, it's one of the items that make up the array.
es: Cuando se refiere a un L</array>, es uno de los elementos que forman el array.

source: When you've found that there isn't a module available for what you're trying to do, and you've had to write the code yourself, consider packaging up the solution into a module and uploading it to CPAN so that others can benefit.
es: Si no existe ningún módulo para lo que usted necesita, y ya se ha encargado de escribir el código, sería un detalle que empaquetara la solución en un módulo y lo subiera a CPAN para que otros programadores puedan usarlo.

source: When you've got your name sorted out and you're sure that your module is wanted and not currently available, it's time to start coding.
es: Cuando se haya decidido por un nombre y esté seguro de que su módulo es necesario y que actualmente no hay nada parecido disponible, puede empezar a programar.

source: When your manager forbids it--but do consider replacing them :-).
es: Cuando su jefe se lo prohíba; en ese caso, debe pensar en reemplazarlo (a su jefe) :-).

source: Whenever anyone creates a chunk of Perl code that they think will be useful to the world, they register as a Perl developer at http://www.cpan.org/modules/04pause.html so that they can then upload their code to the CPAN.
es: Si desarrolla código Perl que considera que puede ser útil para otros programadores, debería registrarse como desarrollador Perl en L<http://www.cpan.org/modules/04pause.html> y subir el código a CPAN.

source: Whenever the L</operating system> is trying to parse a L</pathname> containing a symbolic link, it merely substitutes the new name and continues parsing.
es: Siempre que el L</sistema operativo> intenta analizar una L</ruta de acceso> que contiene un vínculo simbólico, simplemente sustituye el nombre nuevo y continúa con el análisis.

source: Whenever you're communicating text with anything that is external to your perl process, like a database, a text file, a socket, or another program.
es: Siempre que haya intercambio de texto con alguna entidad externa al proceso de perl, como una base de datos, un archivo de texto, un socket u otro programa

source: Whenever your encoded, binary string is used together with a text string, Perl will assume that your binary string was encoded with ISO-8859-1, also known as latin-1.
es: Siempre que la cadena binaria codificada se use junto con una cadena de texto, Perl supondrá que la cadena binaria se codificó con ISO-8859-1 (también llamada latin-1).

source: Where a L</compiler> remembers symbols.
es: Área que un L</compilador> usa para recordar símbolos.

source: Where do I get it?
es: ¿Dónde puedo obtener Perl?

source: Where you look to find a pointer to information somewhere else.
es: Donde se busca un puntero a información que está en otra parte.

source: Whether or not you can properly localize a variable that has been exported from a module depends on how it was exported:
es: Una variable exportada de un módulo se podrá localizar adecuadamente o no en función de cómo se haya exportado:

source: Which characters are to be treated specially as metacharacters varies greatly from context to context.
es: Los caracteres que deben tratarse de forma especial como metacaracteres varían en gran medida de un contexto a otro.

source: Which commit added the first file to match this regex?
es: La confirmación que agregó el primer archivo coincidente con esta expresión regular

source: Which commit caused this example code to break?
es: La confirmación en la que este ejemplo de código dejó de funcionar

source: Which commit caused this example code to start working?
es: La confirmación en la que este ejemplo de código volvió a funcionar

source: Which commit removed the last file to match this regex?
es: La confirmación que eliminó el último archivo coincidente con esta expresión regular

source: Which is shown in the table below.
es: Se indica en la tabla siguiente.

source: Which is fine if you're assembling a tricycle, but if you're building a defranishizing comboflux regurgalator, you really want your own machine shop in which to build special tools.
es: Lo cual es fantástico si lo que se pretende es montar un triciclo, pero si vamos a acometer una empresa faraónica necesitaremos nuestro propio taller de maquinaria para fabricar herramientas especiales.

source: Which makes $richard and $dick the same variable, but leaves @richard and @dick as separate arrays.
es: Esto hace que $beatriz y $bea sean la misma variable; en cambio, @beatriz y @bea son arrays independientes.

source: Which of these modifiers is in effect at any given point in a regular expression depends on a fairly complex set of interactions.
es: El modificador que está en vigor en un punto determinado de una expresión regular depende de un conjunto de interacciones muy complejo.

source: Which one you pick depends on which of these expressions better reflects the above specification of comments.
es: Debe elegir el que refleje mejor la especificación de los comentarios mencionada arriba.

source: Which perhaps unexpectedly yields:
es: del que, inesperadamente, resulta:

source: While Perl programmers are encouraged to use the Perl-specific syntax, the following are also accepted:
es: Aunque se anima a los programadores de Perl a usar la sintaxis específica de Perl, también se acepta lo siguiente:

source: While it's possible to refer directly to these hash keys outside of the class, it's considered a best practice to wrap all access to the attribute with accessor methods.
es: Aunque es posible hacer referencia directamente a estas claves del hash fuera de la clase, es recomendable limitar el acceso a los atributos mediante métodos de acceso.

source: While literal lists and named arrays are often interchangeable, that's not the case for hashes.
es: Aunque las listas literales y los arrays con nombre suelen ser intercambiables, no ocurre así con los hashes.

source: While none of the built-in data types have any arbitrary size limits (apart from memory size), there are still a few arbitrary limits: a given variable name may not be longer than 251 characters.
es: Aunque ninguno de los tipos de datos predefinidos tiene un límite de tamaño (aparte del tamaño de la memoria disponible), hay algunos límites arbitrarios. Por ejemplo, un nombre de variable no puede tener más de 251 caracteres.

source: While not quite all Perl 4 scripts run flawlessly under Perl 5, an update to perl should nearly never invalidate a program written for an earlier version of perl (barring accidental bug fixes and the rare new keyword).
es: Aunque no todos los scripts de Perl 4 se ejecutan sin errores en Perl 5, una actualización de perl no invalidará casi nunca un programa escrito para una versión anterior de perl (salvo correcciones de errores accidentales o una palabra clave nueva).

source: While short identifiers like C<$gotit> are probably ok, use underscores to separate words in longer identifiers.
es: Aunque es aceptable usar identificadores cortos como por ejemplo C<$sinargs> ("sin argumentos"), en los identificadores más largos debe usar guiones bajos para separar palabras.

source: While still in that directory, type:
es: Sin salir de ese directorio, escriba:

source: While the GNU project includes Perl in its distributions, there's no such thing as "GNU Perl".
es: Aunque el proyecto GNU incluye Perl en sus distribuciones, no existe "GNU Perl".

source: While the two classes may differ in many ways, when it comes to the C<print_content()> method, they are the same.
es: Las dos clases pueden ser distintas por diferentes razones, pero en lo que se refiere el método C<imprimir_contenido()> se comportan de la misma forma.

source: While this is possible, we strongly recommend against it.
es: Aunque esto es posible, se recomienda rotundamente no hacerlo.

source: While we don't encourage the submission of patches via GitHub, that will still happen.
es: Aunque no recomendamos enviar parches a través de GitHub, es inevitable que siga ocurriendo.

source: While we strongly suggest you don't build your objects from scratch, you should know the term B<bless>.
es: Aunque recomendamos no construir objetos partiendo de cero, debe conocer el concepto de B<bendición>.

source: While you can still drop down to the bare metal and write your classes by hand, there's really no reason to do that with modern Perl.
es: Aunque puede prescindir de estos sistemas modernos y escribir sus propias clases a mano, no es necesario hacerlo con las versiones modernas de Perl.

source: While you're doing that, make really sure you haven't missed a module similar to the one you're about to write.
es: Y al hacerlo asegúrese de que no ha pasado por alto ningún módulo similar al que va a escribir.

source: Whitespace is irrelevant:
es: El espacio en blanco no es significativo:

source: Who develops it?
es: ¿Quién lo desarrolla?

source: Who has the patch pumpkin?
es: ¿Quién tiene la calabaza de parches?

source: Why is it free?
es: ¿Por qué es gratis?

source: Why waste brainpower on a one-shot when you might want to do something like it again?
es: ¿Por qué gastar energía cerebral en algo que va a usar una sola vez?

source: Wide character in print at example.pl line 2.
es: Wide character in print at ejemplo.pl line 2.

source: Wikiquote has the witticisms from Larry along with their source, including his usenet postings and source code comments.
es: En Wikiquote están registradas las citas ingeniosas de Larry, junto con su fuente. Se incluyen mensajes de usenet y comentarios de códigos fuente.

source: Will output 2, not 1.
es: Mostrará 2, no 1.

source: Windows-specific tests.
es: Pruebas específicas de Windows.

source: With C</a>, one can write C<\d> with confidence that it will only match ASCII characters, and should the need arise to match beyond ASCII, you can instead use C<\p{Digit}> (or C<\p{Word}> for C<\w>).
es: Con C</a>, se puede escribir C<\d> con la confianza de que solo detectará caracteres ASCII, y si fuera necesario detectar dígitos o caracteres no incluidos en ASCII, se puede usar C<\p{Digit}> o C<\p{Word}> en lugar de C<\w>.

source: With C<Object::Tiny>, all accessors are read-only.
es: Con C<Object::Tiny> todos los métodos de acceso son de solo lectura.

source: With C<require> you can get into this problem:
es: Con C<require> puede producirse el siguiente problema:

source: With Perl 5.10 you are no longer limited to the built in pragmata; you can now create user pragmata that modify the behaviour of user functions within a lexical scope.
es: Antes de Perl 5.10 solo podíamos usar los pragmas predefinidos; ahora podemos crear pragmas de usuario personalizados para modificar el comportamiento de funciones de usuario en un ámbito léxico.

source: With no specified encoding layer, Perl tries to fit things in ISO-8859-1 for backward compatibility reasons.
es: Si no se especifica una capa de codificación, Perl intenta aplicar ISO-8859-1 por razones de compatibilidad con versiones anteriores.

source: With respect to computer programs, one that's written well enough that someone has a chance of figuring out what it's trying to do.
es: Si se refiere a un programa informático, indica que está lo suficientemente bien escrito para que otros puedan entender cómo funciona.

source: With respect to files, one that has the proper permission bit set to let you access the file.
es: Si se refiere a un archivo, quiere decir que tiene establecido el bit de permiso apropiado para permitir el acceso al archivo.

source: With the advent of L</Unicode>, this distinction, already suspect, loses even more of its meaning.
es: Con la llegada de L</Unicode>, esta distinción, ya de por sí sospechosa, tiene aún menos sentido.

source: With this configuration, you will be prompted for your gmail password when you run 'git send-email'.
es: Con esta configuración se le pedirá su contraseña de gmail cuando ejecute 'git send-email'.

source: Within a list, the "-" character specifies a range, so that C<a-z> represents all characters between "a" and "z", inclusive.
es: Dentro de una lista, el carácter "-" indica un intervalo, de modo que C<a-z> representa todos los caracteres entre "a" y "z", ambos incluidos.

source: Within a pattern, you may designate subpatterns for later reference by enclosing them in parentheses, and you may refer back to the I<n>th subpattern later in the pattern using the metacharacter \I<n> or \gI<n>.
es: Dentro de un patrón, puede designar subpatrones escribiéndolos entre paréntesis para consultarlos posteriormente, y puede hacer referencia al subpatrón I<n>-ésimo más adelante en el patrón mediante el metacarácter \I<n> o \gI<n>.

source: Within any delimiters for such a construct, allowed spaces are not affected by C</x>, and depend on the construct.
es: Para una construcción como esta, con cualquier tipo de delimitadores, los espacios permitidos no se verán afectados por C</x>, y dependen de la propia construcción.

source: Within its lexical scope you shouldn't have this problem.
es: En su ámbito léxico, este problema no debería producirse.

source: Within search patterns (which also undergo double-quotish substitution) there is an unfortunate ambiguity: Is C</$foo[bar]/> to be interpreted as C</${foo}[bar]/> (where C<[bar]> is a character class for the regular expression) or as C</${foo[bar]}/> (where C<[bar]> is the subscript to array @foo)?
es: Dentro de los patrones de búsqueda (donde también se realiza la sustitución del entrecomillado doble) existe una desafortunada ambigüedad: ¿Debe C</$foo[bar]/> ser interpretado como C</${foo}[bar]/> (donde C<[bar]> es una clase de caracteres para la expresión regular) o como C</${foo[bar]}/> (donde C<[bar]> es el subíndice del array @foo)?

source: Without C<--no-commit>, the commit would be made with nearly no useful message, which would greatly diminish the value of the merge commit as a placeholder for the work's description.
es: Sin C<--no-commit>, se realizará la confirmación sin que se muestre prácticamente ningún mensaje de utilidad, lo que restará mucho valor a la confirmación de combinación como marcador para la descripción del trabajo.

source: Without the C<our $AUTOLOAD> declaration, this code will not compile under the L<strict> pragma.
es: Si se usa el pragma L<strict> sin la declaración C<our $AUTOLOAD>, este código no se compilará.

source: Without the braces, Perl would have looked for a $whospeak, a C, and a C<$who's> variable.
es: Sin las llaves, Perl buscaría las variables $usuarionés, C y C<$usuario's>.

source: Without the flag, it is assumed to be ISO-8859-1.
es: Sin esta marca, se supone que dicha representación es ISO-8859-1.

source: Works only for fixed-width look-behind.
es: Solo funciona para inspecciones hacia atrás de ancho fijo.

source: Would print '1', because C<$foo> holds a reference to the I<original> C<$bar>.
es: Se imprime '1', ya que C<$foo> contiene una referencia a la variable C<$bar> I<original>,

source: Writing a bunch of accessors by hand is also incredibly tedious.
es: También es muy aburrido escribir a mano un conjunto de métodos de acceso.

source: Writing subroutines is easy:
es: Es fácil escribir subrutinas:

source: X<$#> X<array, length>
es: X<$#> X<array, length> X<array, longitud>

source: X</p> X<p modifier>
es: X</p> X<p modifier> X<modificador p>

source: X<__FILE__> X<__LINE__> X<__PACKAGE__> X<__SUB__> X<line> X<file> X<package>
es: X<__FILE__> X<__LINE__> X<__PACKAGE__> X<__SUB__> X<line> X<file> X<package> X<línea> X<archivo> X<paquete>

source: X<boolean> X<bool> X<true> X<false> X<truth>
es: X<boolean> X<bool> X<true> X<false> X<truth> X<booleano> X<verdadero> X<falso> X<verdad>

source: X<constant> X<scalar, constant>
es: X<constant> X<constante> X<scalar, constant> X<escalar, constante>

source: X<defined> X<undefined> X<undef> X<null> X<string, null>
es: X<defined> X<definido> X<undefined> X<indefinido> X<undef> X<null> X<nulo> X<string, null> X<cadena, nulo>

source: X<hash, scalar context> X<hash, bucket> X<bucket>
es: X<hash, scalar context> X<hash, contexto de escalar> X<hash, bucket> X<hash, casilla> X<bucket> X<casillas>

source: X<identifier, case sensitivity> X<case>
es: X<identifier, case sensitivity> X<case> X<identificador, distinguir mayúsculas de minúsculas> X<mayúsculas y minúsculas>

source: X<identifier>
es: X<identifier> X<identificador>

source: X<namespace>
es: X<namespace> X<espacio de nombres>

source: X<number, literal>
es: X<number, literal> X<número, literal>

source: X<regex, capture buffer> X<regexp, capture buffer> X<regex, capture group> X<regexp, capture group> X<regular expression, capture buffer> X<backreference> X<regular expression, capture group> X<backreference> X<\g{1}> X<\g{-1}> X<\g{name}> X<relative backreference> X<named backreference> X<named capture buffer> X<regular expression, named capture buffer> X<named capture group> X<regular expression, named capture group> X<%+> X<$+{name}> X<< \k<name> >> There is no limit to the number of captured substrings that you may use.
es: X<regex, búfer de captura> X<regexp, búfer de captura> X<regex, grupo de captura> X<regexp, grupo de captura> X<expresión regular, búfer de captura> X<retrorreferencia> X<expresión regular, grupo de captura> X<\g{1}> X<\g{-1}> X<\g{nombre}> X<retrorreferencia relativa> X<retrorreferencia con nombre> X<búfer captura con nombre> X<expresión regular, búfer de captura con nombre> X<grupo de captura con nombre> X<expresión regular, grupo de captura con nombre> X<%+> X<$+{nombre}> X<< \k<nombre> >> No hay límite al número de subcadenas capturadas que se pueden usar.

source: X<scalar>
es: X<scalar> X<escalar>

source: X<string, literal>
es: X<string, literal> X<cadena, literal>

source: X<variable, built-in>
es: X<variable, built-in> X<variable, predefinida>

source: X<variable, punctuation>
es: X<variable, punctuation> X<variable, puntuación>

source: XS is an interface description file format used to create an extension interface between Perl and C code (or a C library) which one wishes to use with Perl.
es: XS es un formato de archivo de descripción de interfaz que se usa para crear una interfaz de extensión entre código Perl y código C (o una biblioteca C) que se desea usar en Perl.

source: XS modules serve a rather different purpose, and you should consider different things before distributing them - the popularity of the library you are gluing, the portability to other operating systems, and so on.
es: Los módulos XS se usan para otros fines y hay que tener en cuenta varias cosas antes de distribuirlos, como la popularidad de la biblioteca para la que se está creando un enlace, la portabilidad a otros sistemas operativos, etc.

source: Yes, you can!
es: Por supuesto.

source: Yet Another Compiler Compiler.
es: I<Yet Another Compiler Compiler>.

source: You can copy this module file into your application's library directory for easy bundling.
es: Puede copiar este archivo de módulo en el directorio de bibliotecas de la aplicación para facilitar su empaquetamiento.

source: You can find the latest releases at L<http://www.cpan.org/src/>.
es: Encontrará las versiones más recientes en L<http://www.cpan.org/src/>.

source: You can truncate an array down to nothing by assigning the null list () to it.
es: Para truncar un array y dejarlo vacío, puede asignarle la lista nula ().

source: You know there's a tasty module inside.
es: Y sabe que dentro hay un módulo interesantísimo.

source: You may give the arguments individual names by assigning the values to a L<my|perlfunc/my> list.
es: Puede dar a los argumentos nombres individuales asignando los valores a una lista L<my|perlfunc/my>.

source: You may run in to some code in the wild which uses it.
es: Podría ver código de otros programadores con esta característica.

source: You should also read the L<perlsyn>, L<perlop>, and L<perlsub> documents.
es: También debería leer los documentos L<perlsyn>, L<perlop> y L<perlsub>.

source: You should only send patches to L<perl5-porters@perl.org|mailto:perl5-porters@perl.org> directly if the patch is not ready to be applied, but intended for discussion.
es: Solo debe enviar parches a L<perl5-porters@perl.org|mailto:perl5-porters@perl.org> directamente si el parche no está listo para aplicarse y desea que lo evalúen.

source: You already learned that a B<method> is a subroutine that operates on an object.
es: Ya se ha indicado que un B<método> es una subrutina que opera sobre un objeto.

source: You are I<strongly> advised to follow this introduction with more information from the full Perl manual, the table of contents to which can be found in L<perltoc>.
es: Es I<muy> recomendable complementar esta introducción con información del manual de Perl completo, cuya tabla de contenido se encuentra en L<perltoc>.

source: You are allowed to use underscores (underbars) in numeric literals between digits for legibility (but not multiple underscores in a row: C<23__500> is not legal; C<23_500> is).
es: Está permitido el uso de guiones bajos (caracteres de subrayado) entre dígitos en literales numéricos para mejorar la legibilidad (pero no se permite usar varios guiones bajos seguidos: C<23__500> no es válido; C<23_500>, sí).
